Tutorials/RNGkEpsilonStab/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_half0
    {
        type            cyclic;
    }
    bottom
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
       
    }
    frontBack
    {
        type            empty;
    }
    inlet_half1
    {
        type            cyclic;
    }
}



// ************************************************************************* //
